var arrAttenderMap = {
'数字化创新部' : ['陈宇玲', '卢彤', '赵杰', '许力', '王胜军', '唐瑞', '王天舒', '乔禹', '赵紫峰', '尹丹娜', '钱宝超', '李旭东', '张涛', '刘洁彬', '邓庆野', '周艺', '肖亚男'],
'信息安全和云服务部' : ['蔡铁军', '方永宏', '于晖', '崔岩', '王彦龙', '许京鹏', '杭喆昊', '方毅'],
'IT治理部': ['李焱', '丁艳', '戴雷'] };

var departments = ["数字化创新部", "信息安全和云服务部", "IT治理部"];

var projects = {
	'数字化创新部' : {	
					'其他': ['其他'],
					'协同办公类' : ['新一代集团协同办公平台', '集团统一邮件系统', '网站系统', '其他'],
					'数据平台': ['新一代集团管控数据平台', '其他'],
					'大ERP类':['集团集约化ERP平台', '集团投资管理平台', '集团审计风控平台', '其他'],
					'HR': ['新一代集团eHR平台', '集团招聘系统', '其他'],
					'专业管理应用': ['集团专业创新应用', '其他'],
					'公共平台': ['集团用户中心', '集团能力平台', '集团开发平台', '其他'],
					'现有平台': ['南北ERP优化', '久其报表升级','公文/会议系统','三重一大','原移动办公','原集成办公门户','党建系统','电子档案','原eyou邮件系统', '信息资产管理', '疫情上报系统', '联通短信平台', '网络准入系统', '办公事务流程系统'],
					'总体规划': ['产业平台规划', '其他'],
					'装备': ['集团共性平台建设', '推动装备核心平台升级', '其他'],
					'贸易': ['集团共性平台建设', '其他'],
					'医疗': ['集团共性平台建设', '其他'],		
					'规划':['滚动规划及评价', '其他'],
					'产品':['统筹各类产品规划设计', '其他'],
					'架构':['统筹各类产品系统架构设计', '其他'],
					'研发':['研发团队统筹', '其他'],
					'UI': ['统筹各类产品的UI设计', '其他'],
					'数据': ['数据资产管理和标准制定', '其他'],
					'协调': ['对口落实上级部门信息化工作要求', '其他']
				},
	'信息安全和云服务部':{
	                    '其他': ['其他'],
						'云' : ['私有云', '公有云', '云联网', 'IDC机房', '云视频', '其他'],
						'安全': ['安全体系规划与实施', '数据安全', '其他'],
						'运维': ['系统网络维护', '机房设施', '专项网络建设', '其他'],
						'服务': ['视频会议', '服务台', '终端服务', '电话服务', '其他'],		
					},
	'IT治理部':{
	            '其他': ['其他'],
				'团队建设类': ['党建', '队伍建设', '其他'],
				'预算与合规': ['预算制定&执行', '合规管理', '其他'],
				'综合':['行政服务', '工会服务', '其他'],
			}
};

var projectDetails = {
    "数字化创新部": {
        "协同办公类": {
            "新一代集团协同办公平台": {
                "owner": "李旭东,唐瑞",
                "level": "P3",
                "attender": "张涛,周艺,赵紫峰,赵杰,王天舒,肖亚男",
                "target": [
                    "实现新一代智能协同办公平台上线",
                    "通用类功能80%以上二级企业使用",
                    "定制类功能（如：文事会）不少于5家二级企业使用",
                    "每周平均活跃用户数（除邮件系统外）大于5000人",
                    "年度服务满意度>80%"
                ]
            },
            "集团统一邮件系统": {
                "owner": "王天舒",
                "level": "P2",
                "target": [
                    "现有邮件系统的维护迁移及新平台建设",
                    "80%以上二级企业使用",
                    "每周平均活跃用户数大于10000人"
                ]
            },
            "网站系统": {
                "owner": "王天舒",
                "level": "P1",
                "target": [
                    "按照需求部门要求完成网站建设"
                ]
            }
        },
        "数据平台": {
            "新一代集团管控数据平台": {
                "owner": "赵紫峰",
                "level": "P3",
                "attender": "乔禹,肖亚男,周艺",
                "target": [
                    "实现集团管控新一代数据平台上线",
                    "初步满足战略规划和运营需要，相关部门使用率大于50%",
                    "初步满足集团管理层决策需要，使用率大于50%",
                    "满足2个以上场景的专题调度需要",
                    "按时完成国资委国资监管系统对接要求",
                    "为成员企业提供数据服务工具，二级企业使用率不低于30%"
                ]
            }
        },
        "大ERP类": {
            "集团集约化ERP平台": {
                "owner": "刘洁彬,王胜军",
                "level": "P3",
                "attender": "",
                "target": [
                    "完成集团集约化ERP规划方案制定",
                    "推动部分企业向集团集约化平台演进，不少于3家二级企业",
                    "优化总部财务服务系统能力，实现总部线上报销率>90%",
                    "推动各版块、企业ERP数据整合互通，覆盖80%以上二级企业"
                ]
            },
            "集团投资管理平台": {
                "owner": "刘洁彬",
                "level": "P2",
                "attender": "王胜军",
                "target": [
                    "实现集团投资管理平台上线",
                    "实现全部新投项目的全生命周期管理，50%以上原有投资项目的在线管理",
                    "年度服务满意度>80%"
                ]
            },
            "集团审计风控平台": {
                "owner": "王胜军",
                "level": "P2",
                "attender": "刘洁彬",
                "target": [
                    "实现集团审计风控平台上线",
                    "实现全部新审计项目的全生命周期管理",
                    "建立初步的关键风险检测和预警能力"
                ]
            }
        },
        "HR": {
            "新一代集团eHR平台": {
                "owner": "许力",
                "level": "P3",
                "attender": "李焱,乔禹,许京鹏",
                "target": [
                    "实现新一代集团eHR系统上线",
                    "实现组织人事信息100%准确管理",
                    "实现总部及不少于5家企业薪酬管理",
                    "实现初步员工画像和人才运营能力",
                    "年度服务满意度>80%"
                ]
            },
            "集团招聘系统": {
                "owner": "乔禹",
                "level": "P1",
                "attender": "许力",
                "target": [
                    "实现集团统一招聘系统的上线"
                ]
            }
        },
        "专业管理应用": {
            "集团专业创新应用": {
                "owner": "唐瑞",
                "level": "P3",
                "attender": "肖亚男",
                "target": [
                    "为相关部门建立或优化专业管理工作平台，包括不限于法律、安监、国际、纪检、巡视、后勤、科技创新等",
                    "年度服务满意度>80%"
                ]
            }
        },
        "公共平台": {
            "集团用户中心": {
                "owner": "钱宝超",
                "level": "P2",
                "attender": "王天舒",
                "target": [
                    "实现集团用户中心上线",
                    "确保总部所有新建应用的对接",
                    "实现优化入离职信息化配置流程化管理",
                    "为不少于5家二级企业提供服务"
                ]
            },
            "集团能力平台": {
                "owner": "钱宝超",
                "level": "P2",
                "attender": "李旭东",
                "target": [
                    "实现集团能力平台上线",
                    "实现与二级企业新建API调用的一点对接管理",
                    "组织对二级企业提供能力共享服务，不少于5家企业使用"
                ]
            },
            "集团开发平台": {
                "owner": "李旭东",
                "level": "P2",
                "attender": "钱宝超",
                "target": [
                    "实现集团开发平台上线",
                    "支持紧密型外包开发模式统一管理",
                    "推动合作厂商采用统一的开发模式，覆盖50%以上新建项目"
                ]
            }
        },
        "现有平台": {
            "南北ERP优化": {
                "owner": "王胜军",
                "level": "P1",
                "attender": "赵紫峰",
                "attender1": "乔禹",
                "target": [
                    "组织相关二级企业有序开展ERP升级，避免重复低效投入",
                    "实现过渡期运行支撑与优化"
                ]
            },
            "久其报表升级": {
                "owner": "刘洁彬",
                "level": "P1",
                "attender": "赵紫峰",
                "attender1": "",
                "target": [
                    "挖掘久其报表数据分析价值，支持数据管控平台"
                ]
            },
            "公文/会议系统": {
                "owner": "赵杰",
                "level": "P2",
                "attender": "",
                "attender1": "",
                "target": [
                    "保障现有公文系统的顺畅运行",
                    "保障现有会议系统的顺畅开展",
                    "实现向新一代公文/会议系统平滑迁移"
                ]
            },
            "三重一大": {
                "owner": "王胜军",
                "level": "P1",
                "attender": "赵紫峰",
                "attender1": "",
                "target": [
                    "实现三重一大系统平稳运行",
                    "实现与新一代协同平台、数据平台对接"
                ]
            },
            "原移动办公": {
                "owner": "唐瑞",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": [
                    "实现过渡期运行支撑与优化"
                ]
            },
            "原集成办公门户": {
                "owner": "唐瑞",
                "level": "P1",
                "attender": "赵杰,王天舒",
                "attender1": "",
                "target": [
                    "实现过渡期运行支撑与优化"
                ]
            },
            "党建系统": {
                "owner": "许力",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": [
                    "实现党建系统的持续优化，保障平稳运行"
                ]
            },
            "电子档案": {
                "owner": "许力",
                "level": "P2",
                "attender": "",
                "attender1": "",
                "target": [
                    "保障电子档案系统平稳运行",
                    "至少新增5家以上二级企业使用",
                    "实现新一代协同平台对接，形成知识服务能力"
                ]
            },
            "原eyou邮件系统": {
                "owner": "王天舒",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": []
            },
            "信息资产管理": {
                "owner": "许力",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": [
                    "保障信息资产平稳运行",
                    "数据更新完整"
                ]
            },
            "疫情上报系统": {
                "owner": "唐瑞",
                "level": "P1",
                "attender": "肖亚男",
                "attender1": "",
                "target": []
            },
            "联通短信平台": {
                "owner": "赵杰",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": []
            },
            "网络准入系统": {
                "owner": "赵杰",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": []
            },
            "办公事务流程系统": {
                "owner": "赵杰",
                "level": "P1",
                "attender": "",
                "attender1": "",
                "target": []
            }
        },
        "总体规划": {
            "产业平台规划": {
                "owner": "尹丹娜",
                "level": "T3",
                "attender": "张涛,卢彤,邓庆野,钱宝超,赵杰",
                "attender1": "",
                "target": [
                    "完成集团装备板块信息化规划方案",
                    "完成集团贸易板块信息化规划方案",
                    "完成集团医疗板块信息化规划方案",
                    "帮助其它成员企业明确信息化发展方向",
                    "确保规划与实际执行的方向匹配度大于90%"
                ]
            }
        },
        "装备": {
            "集团共性平台建设": {
                "owner": "邓庆野",
                "level": "P3",
                "attender": "",
                "attender1": "",
                "target": [
                    "推动装备板块共性平台建设，实现不少于2个模块上线运营",
                    "至少有1个模块覆盖板块内全部成员企业"
                ]
            },
            "推动装备核心平台升级": {
                "owner": "邓庆野",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "推动至少2家企业在财务、研发设计、生产管理等领域的平台升级"
                ]
            }
        },
        "贸易": {
            "集团共性平台建设": {
                "owner": "张涛",
                "level": "P3",
                "attender": "",
                "attender1": "",
                "target": [
                    "实现集团国际贸易平台上线运营",
                    "实现80%以上集团境外机构入驻",
                    "实现2类以上品类商品的上线运营"
                ]
            }
        },
        "医疗": {
            "集团共性平台建设": {
                "owner": "尹丹娜",
                "level": "P3",
                "attender": "卢彤",
                "attender1": "",
                "target": [
                    "推动集团共性平台集中统一建设",
                    "实现1个以上体现集团医疗合力的应用上线"
                ]
            }
        },
        "规划": {
            "滚动规划及评价": {
                "owner": "尹丹娜",
                "level": "T2",
                "attender": "卢彤",
                "attender1": "",
                "target": [
                    "完成2020-2024年度信息化总体发展规划工作",
                    "组织完成对所有二级企业的信息化发展水平评价"
                ]
            }
        },
        "产品": {
            "统筹各类产品规划设计": {
                "owner": "张涛",
                "level": "T2",
                "attender": "周艺",
                "attender1": "",
                "target": [
                    "完成集团信息化产品布局和发展路线，确保创新性",
                    "实现集团总部信息化需求统筹管理，提供月度需求分析"
                ]
            }
        },
        "架构": {
            "统筹各类产品系统架构设计": {
                "owner": "钱宝超",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "完成集团总部信息化架构设计，确保集成性、合理性、先进性"
                ]
            }
        },
        "研发": {
            "研发团队统筹": {
                "owner": "李旭东",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "完成集团自主可控研发团队组建和管理，确保高效、先进"
                ]
            }
        },
        "UI": {
            "统筹各类产品的UI设计": {
                "owner": "周艺",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "组织各类总部平台的UI设计，确保体验友好",
                    "做好各领域运营推广环节宣传方案，年度宣传不少于5次"
                ]
            }
        },
        "数据": {
            "数据资产管理和标准制定": {
                "owner": "赵紫峰",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "完成数据资产和标准制定",
                    "结合数据平台建设同步落地"
                ]
            }
        },
        "协调": {
            "对口落实上级部门信息化工作要求": {
                "owner": "卢彤",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "完成集团各类督办、国资委、网信办等通知要求落实反馈",
                    "总结形成上级工作部署和落实情况目录"
                ]
            }
        }
    },
    "信息安全和云服务部": {
        "云": {
            "私有云": {
                "owner": "蔡铁军",
                "level": "P3",
                "attender": "金波,方永宏",
                "attender1": "于晖,崔岩",
                "target": [
                    "实现集团通用技术私有云建设与上线运营",
                    "实现对总部全部新建应用的支撑",
                    "对80%以上成员企业新建应用的支撑",
                    "组织完成总部通用大厦应用迁移",
                    "成员企业年度服务满意度>80%"
                ]
            },
            "公有云": {
                "owner": "于晖",
                "level": "P1",
                "attender": "钱宝超",
                "attender1": "",
                "target": [
                    "实现集团公有云服务的采购与集约化管理",
                    "按月度进行使用量汇总与分析"
                ]
            },
            "云联网": {
                "owner": "于晖",
                "level": "P2",
                "attender": "方永宏,金波",
                "attender1": "",
                "target": [
                    "完成集团二级成员企业云联网接入",
                    "对云联网状态进行监控，按需动态调整",
                    "成员企业年度服务满意度>80%"
                ]
            },
            "IDC机房": {
                "owner": "方永宏",
                "level": "P2",
                "attender": "金波,方毅",
                "attender1": "",
                "target": [
                    "完成私有云IDC机房服务的采购与布线",
                    "完成机房日常运行监控、安全管理"
                ]
            },
            "云视频": {
                "owner": "崔岩",
                "level": "P1",
                "attender": "许京鹏,王彦龙,方毅",
                "attender1": "",
                "target": [
                    "完成云视频系统的运行管理和服务支持"
                ]
            }
        },
        "安全": {
            "安全体系规划与实施": {
                "owner": "金波",
                "level": "T3",
                "attender": "方永宏,于晖,崔岩",
                "attender1": "",
                "target": [
                    "完成安全体系规划，确保安全的组织与制度的完备性",
                    "完善安全技术手段，初步实现总部平台的集中化安全运营监管",
                    "对子公司提供2项以上的共性安全服务，覆盖50%以上成员企业",
                    "确保应急响应体系落地，实现对重点安全事件的管理",
                    "组织开展重大节日活动的安全保障、安全技术培训和网络安全周",
                    "全年不发生重大网络安全事件"
                ]
            },
            "数据安全": {
                "owner": "方永宏",
                "level": "T2",
                "attender": "杭喆昊",
                "attender1": "",
                "target": [
                    "确保备份的有效性，不发生数据丢失事件，形成日检查报告",
                    "定期开展恢复测试演练",
                    "确保主机数据库的安全"
                ]
            }
        },
        "运维": {
            "系统网络维护": {
                "owner": "于晖,崔岩,杭喆昊",
                "level": "T1",
                "attender": "",
                "attender1": "",
                "target": [
                    "落实定期巡检、日检查机制，形成报告记录",
                    "履行按需规范调整优化，做好日志管理",
                    "全年不发生重大运行事故"
                ]
            },
            "机房设施": {
                "owner": "杭喆昊,许京鹏,方毅",
                "level": "T1",
                "attender": "",
                "attender1": "",
                "target": [
                    "落实定期巡检、日检查机制，形成报告记录",
                    "全年不发生重大运行事故"
                ]
            },
            "专项网络建设": {
                "owner": "崔岩",
                "level": "T1",
                "attender": "方毅",
                "attender1": "",
                "target": [
                    "按上级要求完成专项网络建设"
                ]
            }
        },
        "服务": {
            "视频会议": {
                "owner": "崔岩",
                "level": "T2",
                "attender": "许京鹏,王彦龙",
                "attender1": "杭喆昊",
                "target": [
                    "保障集团各级各类视频会议顺利进行，全年不发生重大运行事故",
                    "升级改造视频会议系统，提高稳定性和会议质量"
                ]
            },
            "服务台": {
                "owner": "王彦龙",
                "level": "P2",
                "attender": "杭喆昊",
                "attender1": "",
                "target": [
                    "建立总部统一服务台，面向全集团提供IT服务",
                    "服务形式上支持400、邮件、在线等多种方式，完成一线问题受理和转发",
                    "年度服务满意度>90%"
                ]
            },
            "终端服务": {
                "owner": "王彦龙,杭喆昊,许京鹏,方毅",
                "level": "T2",
                "attender": "",
                "attender1": "",
                "target": [
                    "确保日常终端服务满意度>95%",
                    "完成年度终端服务提升计划，确保满意度>95%"
                ]
            },
            "电话服务": {
                "owner": "王彦龙,方毅",
                "level": "T1",
                "attender": "",
                "attender1": "",
                "target": [
                    "落实定期巡检、日检查机制，形成报告记录",
                    "保障系统稳定性、服务及时性，确保满意度>95%"
                ]
            }
        }
    },
    "IT治理部": {
        "团队建设类": {
            "党建": {
                "owner": "刘海舟",
                "level": "S2",
                "attender": "",
                "attender1": "",
                "target": [
                    "按“一强两无三高”五星党支部标准，落实支部年度工作计划",
                    "每月至少组织1次党员集中学习，定期组织党建知识考试",
                    "发展积极分子和预备党员，力争支部党员比例在45%以上"
                ]
            },
            "队伍建设": {
                "owner": "李焱",
                "level": "S3",
                "attender": "丁艳,乔禹",
                "attender1": "",
                "target": [
                    "对集团信息化3支队伍实现人员画像，建立人才分层资源池",
                    "常态化培训，组织每周日常培训，每月专业技术培训，每季度交流会",
                    "按需扩充总部信息化人员队伍，建立紧密型外包团队规模不少于50人",
                    "加强中心团队文化建设，结合月度评优、每周培训、周例会、月点评、季考核等工作，营造“快乐，不舒适”工作氛围",
                    "组织开展自有团队与合作厂商团队管理与考核"
                ]
            }
        },
        "预算与合规": {
            "预算制定&执行": {
                "owner": "戴雷",
                "level": "S2",
                "attender": "丁艳",
                "attender1": "",
                "target": [
                    "组织年度集团总部信息化预算、费用预算制定，确保合理性",
                    "统筹费用性预算执行，包括年度维保服务、月度专线和办公管理类费用等统筹支付，确保合规",
                    "统筹信息化项目付款，确保合规"
                ]
            },
            "合规管理": {
                "owner": "丁艳,戴雷",
                "level": "S2",
                "attender": "李焱",
                "attender1": "",
                "target": [
                    "按季度检查系统、网络运行安全的工作、文档规范性，形成检查报告",
                    "按季度检查各项目的立项、招标、采购、验收、付款、文档等合规性，形成检查报告",
                    "统筹信息中心涉及党建、人事、资金使用等重点事务的规范保障，形成重点工作纪实记录",
                    "组织完善信息化规章制度建设，重点工作、关键环节有规可依",
                    "统筹各类文档的归档管理"
                ]
            }
        },
        "综合": {
            "行政服务": {
                "owner": "戴雷",
                "level": "S2",
                "attender": "",
                "attender1": "李焱",
                "target": [
                    "优化办公环境，解决员工办公需求，年度满意度大于90%",
                    "做好文书管理服务，及时准确传达公司各项文事会，做到有分析有建议"
                ]
            },
            "工会": {
                "owner": "王天舒",
                "level": "S1",
                "attender": "",
                "attender1": "",
                "target": []
            }
        }
    }
};