var projects = {
	'数字化创新部' : {
					'协同办公类' : ['集团协同办公平台', '集团统一邮件系统', '网站系统'], 
					'数据平台': ['集团管控数据平台'], 
					'大ERP类':['集团集约化ERP平台', '集团投资管理平台', '集团审计风控平台'],
					'HR': ['新一代集团eHR平台', '集团招聘系统'],
					'专业管理应用': ['集团专业创新应用'],
					'公共平台': ['集团用户中心', '集团能力平台', '集团开发平台'],
					'现有平台': ['南北ERP优化', '久其报表升级','公文/会议系统','三重一大','原移动办公','原集成办公门户','党建系统','电子档案','信息资产管理'],
					'总体规范': ['产业平台规划'],
					'装备': ['集团共性平台建设', '推动装备核心平台升级'],
					'贸易': ['集团共性平台建设'],
					'医疗': ['集团共性平台建设'],
					'其他': ['其他']
				},
	'信息安全和云服务部':{
						'云' : ['私有云', '公有云', '云联网', 'IDC机房', '云视频'],
						'安全': ['安全体系规划与实施', '数据安全'],
						'运维': ['系统网络维护', '机房设施', '专项网络建设'],
						'服务': ['视频会议', '服务台', '终端服务', '电话服务'],
						'其他': ['其他']
					},
	'IT治理部':{
				'团队建设类': ['党建', '队伍建设'],
				'预算与合规': ['预算制定&执行', '合规管理'],
				'综合':['行政服务'],
				'其他': ['其他']
			}
};

var projectDetails = {
	'数字化创新部':{},
	'信息安全和云服务部':{},
	'IT治理部':{}
};

var arrAttenderMap = {
'数字化创新部' : ['陈宇玲', '卢彤', '赵杰', '许力', '王胜军', '唐瑞', '王天舒', '乔禹', '赵紫峰', '尹丹娜', '钱宝超', '李旭东', '张涛', '刘洁彬', '邓庆野', '周艺', '肖亚男'],
'信息安全和云服务部' : ['蔡铁军', '方永宏', '于晖', '崔岩', '王彦龙', '许京鹏', '杭喆昊', '方毅'],
'IT治理部': ['李焱', '丁艳', '戴雷'] };

var departments = ["数字化创新部", "信息安全和云服务部", "IT治理部"];

